[
  {
    "seedId": "cultures-language-guide",
    "title": "Lore:The Languages of The Berg",
    "slug": "lore-languages",
    "summary": "A comprehensive guide to how names work in each culture - Aurora's ice-memory echoes, Nightshelf's whispered fragments, and Orca's deed-chains.",
    "status": "published",
    "content": "# The Languages of The Berg\n\nAurora Berg's three cultures don't just speak differently - they *think* about identity differently. This shapes how they name everything: people, places, factions, and artifacts. For cultural context, see Aurora Stack, Nightshelf, and Orca.\n\n---\n\n## Core Premise: \"The Ice Remembers\"\n\nPenguins don't experience time linearly. The ice holds memory - events echo forward and backward. This fundamentally shapes how they name things:\n\n- **Names are not labels, they are echoes** - a name carries what the ice remembers about the thing\n- **Identity is layered** - who you are now, who you were, who the ice says you'll become\n- **Sound matters differently** - penguin hearing evolved for ice acoustics, not air\n\n---\n\n## Aurora Stack: The Parenthetical Echo System\n\n### Concept: Names Have Memory-Annotations\n\nAurora penguins acknowledge that the ice annotates everything. When the ice \"remembers\" something about you, that memory becomes part of your name. These **parenthetical echoes** are not optional flourishes - they're the ice's witness to your existence.\n\n### Grammar Patterns\n\n**Simple Echo** - `Name (ice-memory)`\n```\nHigh-Beak Auditor Selka    -- the current Aurora Stack mayor\nPiien (twice-hatched)      -- survived something, reborn\nLosek (trade-blessed)      -- the ice saw prosperity follow them\nValmori (echo: Valum)      -- carries an ancestor's echo\n```\n\n**Clan-Echo Chain** - `Name (echo) clan'Place`\n```\nVoraesueina (frost-written) kria'Spire\nPeiaeesi (light-descended) rukar'Reach\nTeime (ice-spoken) molok'Depths\n```\nThe clan marker (`kria'`, `rukar'`) indicates lineage. The place indicates origin-territory.\n\n**Layered Echoes** - for important figures, the ice remembers MORE\n```\nSkailaen (twice-blessed, light-bearer, echo: Skai)\nNalreniro (frost-bane, void-touched, echo: Nalren, echo: Nal)\n```\nMore echoes = more history = more significance.\n\n### Sound Profile\n- Soft consonants: s, l, r, k, n, m, w, v\n- Diphthongs: ae, ei, ue, oa, ia\n- Endings: -ok, -ik, -ael, -ien, -uma, -eiva\n- The parenthetical content uses more English sounds - the ice \"translating\" for us\n\n---\n\n## Nightshelf: The Incomplete Name System\n\n### Concept: Full Names Hold Power (So Never Speak Them)\n\nIn shadow, names are dangerous. To know something's full name is to have power over it. Nightshelf penguins therefore:\n\n- Never speak complete names\n- Leave beginnings OR endings unvoiced\n- Use fragments that imply wholeness\n- Mark truncations with the crescent moon (☽) - symbol of incomplete cycles\n\n### Grammar Patterns\n\n**Moon-Prefix** - `☽'name` (beginning consumed by shadow)\n```\n☽'varius                   -- what came before is swallowed\n☽'ent' Vigil               -- truncated fragment + title\n☽'shadow Xarem~            -- prefix + trailing whisper\n```\n\n**Moon-Suffix** - `name☽` (ending fades into darkness)\n```\nUmbra☽                     -- the shadow continues unspeaking\nNight☽ Silvsomiae          -- faded ending + full name\nMoth☽ Shimmer              -- mid-name truncation\n```\n\n**Internal Truncation** - `name∴name` (syllables swallowed mid-word)\n```\nDusk∴glide                 -- the \"therefore\" mark for consumed syllables\nCircle∴sea-bound~          -- internal + trailing whisper\nApex∴enchant               -- power-words with hidden cores\n```\n\n**Whisper-Forms** - `name~` (trails into inaudibility)\n```\nReniava~                   -- fades to whisper at the end\nDeal' Covenant~            -- possessive + whisper\nThe Shawled Scar~          -- even locations whisper\n```\n\n### Sound Profile\n- Latin-influenced but BROKEN: -us, -ae, -um, but cut short\n- Liquid sounds: l, r (things that flow into shadow)\n- Sibilants: s, soft-c (whisper sounds)\n- The ☽ and ∴ are *pronounced* as brief pauses or catches in the throat\n- AVOID hard stops in the middle of names - shadows don't stop\n\n---\n\n## Orca: The Deed-Name System\n\n### Concept: You ARE What You've Done\n\nOrcas don't have names in the penguin sense. An orca's identity IS their kills, their territory, their pod-role.\n\n### Grammar Patterns\n\n**Kill-Names** - `[Method]-[Prey]`\n```\nRend-kzul                  -- seal-render (kzul = seal in Orca)\nGnash-threk                -- whale-gnasher\nCrush-pngk                 -- penguin-crusher\n```\n\n**Accumulation Names** - more kills = longer name\n```\nYoung orca: Kzul-rend\nExperienced: Kzul-threk-rend-vor\nElder: Deep-kzul-threk-pngk-rend-vor-grrul (barely pronounceable)\n```\n\n### Sound Profile (STRICT)\n- Consonants: k, g, r, th, ng, z, kh, gh, rr, d, n (hard only)\n- Vowels: u, i, a (short), occasional schwa\n- Clusters: REQUIRED - kr, gr, th, ng, zk, khr, rnd, thng\n- NO soft sounds, NO diphthongs, NO articles\n\n---\n\n## Grammar Differentiation Summary\n\n| Feature | Aurora | Nightshelf | Orca |\n|---------|--------|------------|------|\n| Parenthetical echoes `()` | YES (core) | NO | NO |\n| Moon truncation `☽` | NO | YES (core) | NO |\n| Internal elision `∴` | NO | YES | NO |\n| Whisper trailing `~` | NO | YES | NO |\n| Deed-chains | NO | NO | YES (core) |\n| Vowel richness | High | Medium | Minimal |\n| Consonant clusters | Low | Low | REQUIRED |\n\n---\n\n## Exception: The Before Times Artifacts\n\nNot all entities follow cultural naming conventions. Artifacts from The Before Times - ancient relics of unknown origin - bear alphanumeric serial numbers like `8H-H1Y0B` or `T5-W5WJ3P`. These are not names but *designations*, inscribed by whatever intelligence created them.\n\nThe artifacts resist proper naming. Aurora penguins cannot add echoes to them - the ice refuses to annotate what it cannot comprehend. Nightshelf penguins cannot truncate designations that are already incomplete. Orca cannot claim kills they did not make.\n\nCommon names exist (`Prime Shard`, `Extinction Node`) but the serial numbers persist in formal contexts. See The Before Times for more on these apocalyptic relics."
  },
  {
    "seedId": "world-the-berg",
    "title": "World:The Berg",
    "slug": "world-the-berg",
    "summary": "An overview of The Berg - the vast frozen continent where penguin civilization thrives in the eternal dance between light and dark.",
    "status": "published",
    "content": "# The Berg\n\nAurora Berg is a continent of ice at the bottom of the world - a place where the aurora dances above towering glaciers, where shadows pool in crevasses that have never seen light, and where the boundary between the living and the remembered grows thin in The Long Dark.\n\n---\n\n## Geography\n\nAurora Berg is not a single landmass but a complex arrangement of ice shelves, volcanic archipelagos, and the great central plateau known as **The Stack**.\n\n### Aurora Stack\n\nThe highest reaches of Aurora Berg, where permanent settlements cling to volcanic vents that provide warmth against the endless cold. Here the aurora is visible even during the brief summer, painting the ice in greens and purples. Aurora Stack rises in tiers - each level a different microclimate, each hosting its own communities.\n\n- **The Upper Reaches** - Closest to the sky, where ice-seers read fortunes in the aurora's dance\n- **The Trade Terraces** - The great markets where goods flow between all cultures, dominated by The Icebound Exchange\n- **The Huddle Warrens** - Dense residential areas where warmth is shared\n- **The Foundation Depths** - Ancient tunnels carved by volcanic heat\n\n### Nightfall Shelf\n\nBeneath the permanent ice shelf, where sunlight never penetrates. Nightfall Shelf exists in perpetual twilight, lit only by bioluminescent creatures and the faint glow of volcanic vents. Here, shadow is not merely absence of light - it is a substance, a medium through which power flows.\n\n- **The Shroud Depths** - Where the shelf meets the sea\n- **The Whisper Galleries** - Acoustic chambers that carry secrets\n- **The Void Markets** - Where forbidden things change hands, controlled by The Midnight Claws\n- **The Glow-Fissure** - A deep crack pulsing with cold blue-green light, its depths forbidden\n\n### The Orca Territories\n\nThe open waters surrounding Aurora Berg, where the apex predators rule. Orcas do not build - they claim. Their territories are defined by hunting grounds, marked by the bones of their kills.\n\n- **The Hunting Currents** - Migration routes of prey\n- **The Corpse Current** - Where the dead god's blood still circulates, sacred to The Wake-Singers\n- **The Deep Trenches** - Where elder orcas descend to die\n- **The Killing Shallows** - Ambush zones near penguin colonies\n\n---\n\n## The Seasons\n\nThe Berg knows only two true seasons: **The Endless Day** and **The Long Dark**.\n\n### The Endless Day (Summer)\n\nFor four months, the sun never sets. The ice retreats, the seas teem with krill, and the penguins gorge themselves in preparation for what comes. This is the time of plenty - of festivals, of mating, of forgetting the horrors of winter.\n\nBut the Endless Day is not without danger. The melting ice reveals things that should stay buried. Ancient artifacts surface. Crevasses open without warning. And the orcas grow bold, pressing ever closer to the shore.\n\n### The Long Dark (Winter)\n\nFor four months, the sun never rises. Temperatures plunge to unsurvivable levels. The sea freezes solid for miles from shore. The penguins huddle in their warrens, surviving on stored fat and the warmth of each other.\n\nIn the Long Dark, the boundary between the living world and the ice-memory grows thin. The ancestors speak more clearly. Visions come unbidden. Some penguins walk out onto the ice and never return - whether taken by cold, by predators, or by something else entirely, none can say.\n\n### The Transitions\n\nThe times between - **The Thaw** and **The Freeze** - are the most dangerous of all. The ice is unstable. The weather unpredictable. Orcas hunt most aggressively during the Thaw, knowing their window is closing.\n\n---\n\n## The Three Peoples\n\nThe Berg is home to three sapient cultures, each adapted to their environment in ways that go beyond the physical.\n\n### The Aurora Penguins\n\nDwellers of the high ice, the Aurora penguins are the most numerous and the most organized. They believe the ice remembers all things, and that identity is not fixed but accumulated - a penguin is the sum of what the ice has witnessed them become.\n\nThey are traders, diplomats, builders. Their society is hierarchical but fluid - prominence can be earned, and echoes can be added to any name through great deeds.\n\n### The Nightshelf Penguins  \n\nThose who dwell beneath, in the eternal twilight. The Nightshelf penguins have adapted to darkness in ways that unsettle their surface cousins. They see by echolocation and bioluminescence. They believe that names hold power, and so they never speak them fully.\n\nThey are mystics, assassins, keepers of forbidden knowledge. Their society is built on secrets - what you know determines what you are.\n\n### The Orca\n\nThe apex predators of The Berg's waters. Orcas are not evil - they are simply what they are. They hunt penguins because penguins are prey. They respect strength and despise weakness. Their culture is one of pure meritocracy - you are your kills, nothing more.\n\nSome orcas have learned to communicate with penguins. Some even trade. But no penguin ever forgets that an orca's friendship is conditional, and that condition is: *be more useful alive than dead*.\n\n---\n\n## The Ice Remembers\n\nThe most fundamental truth of The Berg: the ice is not merely frozen water. It is a medium of memory. Events leave impressions. The dead leave echoes. Time itself flows differently here, pooling in some places, rushing in others. See The Ice Remembers for a deeper exploration of this phenomenon.\n\nThis is why penguin names carry parenthetical echoes - the ice annotates existence. This is why the Nightshelf fear complete names - to name something fully is to give the ice power over it. This is why orcas define themselves by deeds - in the water, there is no ice to remember, so they must carry their own history in their names. See The Languages of The Berg for how each culture's naming conventions reflect these beliefs.\n\nThe Berg is not just a place. It is a memory palace the size of a continent, and everything that happens here is recorded forever in the frost."
  },
  {
    "seedId": "cultures-aurora-stack",
    "title": "Cultures:Aurora Stack",
    "slug": "cultures-aurora-stack",
    "summary": "The Aurora Stack penguins - traders, builders, and keepers of ice-memory who believe identity is accumulated through witnessed deeds.",
    "status": "published",
    "content": "# Aurora Stack\n\n*\"The ice remembers what we choose to forget.\"*\n\nThe Aurora Stack penguins are the dominant culture of Aurora Berg's surface - a civilization of traders, builders, and ice-readers who have turned the volcanic highlands into a thriving society. They are named for the aurora borealis that dances above their highest settlements, which they believe carries messages from the ice-memory itself.\n\n---\n\n## Core Beliefs\n\n### The Ice-Memory\n\nAurora penguins believe that the ice of The Berg is not inert matter but a vast, slow consciousness that records everything. Every deed, every word, every death leaves an impression in the frost. The ice does not judge - it simply remembers. See The Ice Remembers for more on this phenomenon.\n\nThis belief shapes everything about Aurora society:\n\n- **Names accumulate** - A penguin's name grows as the ice witnesses their deeds\n- **The past is present** - Ancestors can be consulted through ice-reading\n- **Nothing is truly lost** - Even the dead persist as echoes in the frost\n- **Reputation is literal** - What the ice remembers about you IS who you are\n\n### The Witnessed Life\n\nAurora penguins believe that an unwitnessed deed is an incomplete deed. This is why they gather in crowds, why they announce their actions, why they carve records into ice-walls. To do something alone, in secret, is to risk having it forgotten - and what is forgotten might as well never have happened.\n\n---\n\n## Society\n\n### The Tier System\n\nAurora society is organized vertically, reflecting the physical structure of their volcanic home:\n\n**The Apex** - Ice-seers, high auditors, the most prominent voices. They dwell closest to the aurora and are believed to hear the ice-memory most clearly. High-Beak Auditor Selka currently leads from here.\n\n**The Trade Terraces** - Merchants, crafters, the economic heart. Most penguins spend their lives here, accumulating modest echoes through honest work. The Icebound Exchange dominates commerce here.\n\n**The Huddle Warrens** - The common masses, living in dense communal arrangements. Here, warmth is shared freely, and individual prominence matters less than collective survival.\n\n**The Foundation** - Workers who maintain the volcanic vents and tunnels. Essential but low-status - they work in darkness, where the ice-memory is thin.\n\n### Prominence\n\nStatus in Aurora society is measured in **prominence** - a combination of deeds witnessed, echoes earned, and the ice-memory's regard. Prominence is not inherited; each penguin begins life with only their hatching-echo and must earn the rest.\n\nLevels of prominence:\n- **Forgotten** - No echoes, no witnesses. Essentially non-persons.\n- **Marginal** - A few echoes. Most young penguins.\n- **Recognized** - Solid reputation, respected voice.\n- **Renowned** - Many echoes, significant influence.\n- **Mythic** - So many echoes that the ice speaks their name unbidden.\n\n### Clans and Lineage\n\nAurora penguins organize into clans marked by a possessive prefix (val', kria', rukar', etc.). Clan membership is determined by mentorship, not blood - you belong to the clan of whoever taught you to read the ice.\n\nThis means clans are constantly shifting, as promising young penguins are adopted by prominent mentors seeking to expand their influence.\n\n---\n\n## Practices\n\n### Ice-Reading\n\nThe most sacred practice of Aurora culture. Trained ice-readers can perceive the echoes frozen in the ice - glimpses of past events, whispers of the dead, sometimes even hints of what the ice expects to happen.\n\nIce-reading is not prophecy. The ice remembers the past and perceives the present, but it does not know the future. What it offers instead is *pattern recognition* - the ice has seen so much that it can often predict what comes next.\n\n### The Naming Ceremonies\n\nWhen a penguin earns a new echo, it must be formally witnessed and recorded. The naming ceremony involves:\n\n1. **The Deed Recitation** - Public description of what was done\n2. **The Witness Confirmation** - Others attest to what they saw\n3. **The Ice-Reading** - A seer confirms the ice has recorded it\n4. **The Name Extension** - The new echo is added to the name\n\nThese ceremonies are social events, often combined with feasts and celebrations.\n\n### The Huddle\n\nDuring The Long Dark, Aurora penguins practice the Huddle - massive gatherings where thousands of penguins press together for warmth. The Huddle is more than survival; it is a spiritual practice.\n\nIn the Huddle, individual identity partially dissolves. Penguins rotate from the cold outer edge to the warm center and back, sharing the burden equally. No prominence matters in the Huddle - the most mythic penguin takes their turn on the outer edge like anyone else.\n\nMany Aurora penguins describe the Huddle as the closest they come to truly understanding the ice-memory - a brief experience of being part of something larger than themselves.\n\n---\n\n## Relations with Other Cultures\n\n### With the Nightshelf\n\nAurora penguins find their under-ice cousins unsettling. The Nightshelf's obsession with secrecy, their incomplete names, their comfort in darkness - all of this violates Aurora values. But trade continues regardless, because the Nightshelf have things the surface needs: rare minerals, bioluminescent materials, knowledge that can only be found in shadow.\n\nOfficial relations are correct but cold. Unofficial relations are more complex - there are always penguins willing to deal in the dark.\n\n### With the Orca\n\nFear tempered by necessity. Aurora penguins know the orcas are predators, but they also know the orcas can be bargained with. The great trade-treaties that allow safe passage through certain waters are Aurora achievements, purchased with goods, information, and occasionally... other considerations.\n\nNo Aurora penguin entirely trusts an orca. But many have learned that orca respect can be earned, and that a respected penguin is a penguin left uneaten.\n\n---\n\n## The Aurora Ideal\n\nThe perfect Aurora penguin lives a witnessed life, accumulates many echoes, contributes to their clan's prominence, and eventually becomes part of the ice-memory themselves - not truly dead, but transformed into something that will advise future generations.\n\nThis is the Aurora dream: to be remembered. Not for vanity, but because memory is the only immortality The Berg offers, and the ice remembers forever."
  },
  {
    "seedId": "cultures-nightshelf",
    "title": "Cultures:Nightshelf",
    "slug": "cultures-nightshelf",
    "summary": "The Nightshelf penguins - shadow-dwellers who believe names hold power and secrets are the true currency of existence.",
    "status": "published",
    "content": "# Nightfall Shelf\n\n*\"What is spoken can be taken. What is whispered can be traded. What is silent... is truly yours.\"*\n\nBeneath the permanent ice shelf, where sunlight has never penetrated, the Nightshelf penguins have built a civilization in eternal twilight. Nightfall Shelf is their home - a labyrinth of tunnels lit by bioluminescent ice glyphs and fire-core braziers. They are mystics and merchants of secrets, beings who have adapted to darkness so completely that the surface world seems garish and exposed to them.\n\n---\n\n## Core Beliefs\n\n### The Power of Names\n\nNightshelf penguins believe that names are not labels but *bindings*. To know something's true name is to have power over it. This is why they never speak names completely - every name is truncated, whispered, or left deliberately incomplete.\n\n- **Moon-hidden names** (☽'varius) - The crescent moon (☽) marks what shadow has consumed\n- **Whisper-names** (Tenebris~) - The tilde (~) marks where voice fades to silence\n- **Swallowed syllables** (Dusk∴glide) - The therefore mark (∴) shows internal truncation\n\nA Nightshelf penguin's full, true name is known only to themselves. Some say even this is not entirely true - that the deepest part of a name is hidden even from its bearer, known only to the shadow itself. See The Languages of The Berg for how Nightshelf naming conventions differ from other cultures.\n\n### The Shadow as Medium\n\nWhere Aurora penguins see ice-memory, Nightshelf penguins perceive *shadow-substance*. They believe darkness is not merely absence of light but a medium through which power flows. In sufficient darkness, the boundaries between things become... negotiable.\n\nThis is not metaphor to the Nightshelf. Their mystics can do things in shadow that would be impossible in light. Whether this is true magic or simply skills adapted to darkness, outsiders cannot say.\n\n### The Economy of Secrets\n\nNightshelf society runs on secrets. Information is currency. What you know determines what you are. A penguin who knows nothing is nothing; a penguin who knows everything is... dangerous.\n\nThis creates a culture of careful transaction. Every conversation is a negotiation. Every relationship is an exchange of carefully measured revelations.\n\n---\n\n## Society\n\n### The Veiled Structure\n\nNightshelf society appears chaotic to outsiders, but this is deliberate misdirection. The true structure is hidden:\n\n**The Unspoken** - The ruling council, whose members' identities are unknown even to each other. They communicate through intermediaries and dead drops.\n\n**The Brokers** - Merchants of information who facilitate trades between parties who must never meet.\n\n**The Whisperers** - Mystics who can read secrets from shadow itself. Consulted for divination and employed for espionage.\n\n**The Veiled** - Ordinary citizens who go about their lives in careful anonymity, revealing as little as possible.\n\n**The Exposed** - Those who have lost their secrets, whether through carelessness or punishment. They are pitied and avoided.\n\n### The Secret Markets\n\nThe Void Markets of the Nightshelf are legendary. Here, anything can be bought and sold - information, services, objects that should not exist, and occasionally... names. The Midnight Claws control most of the shadow economy, with Shadow-Broker Nyla at their head.\n\nTo purchase someone's name is to purchase power over them. Name-trading is technically forbidden, but \"technical\" means little in a society built on loopholes and shadows.\n\n### Shadow-Debts\n\nNightshelf penguins track obligations through \"shadow-debts\" - binding agreements enforced not by law but by the shadow itself. Break a shadow-debt, and the darkness remembers. Those who accumulate too many broken debts find that shadows no longer shelter them.\n\n---\n\n## Practices\n\n### The Whisper Tongue\n\nNightshelf penguins have developed a form of communication that exists at the edge of audibility. The Whisper Tongue uses frequencies that don't carry far, meanings encoded in what is *not* said, and silences that speak louder than words.\n\nLearning the Whisper Tongue takes years. Outsiders find it maddening - conversations that seem to be about nothing, agreements reached without apparent negotiation, insults delivered through compliments.\n\n### Shadow-Walking\n\nTrained Nightshelf mystics can \"walk\" through shadows - not teleportation, but a way of moving through darkness that seems to compress distance. A shadow-walker can cross a room in a single step if the shadows are deep enough.\n\nSkeptics claim this is simply excellent night-vision combined with silent movement. The Nightshelf do not correct them.\n\n### The Dreaming Pools\n\nSacred sites where the boundary between shadow and substance grows thin. Penguins who immerse themselves in the Dreaming Pools report visions - glimpses of secrets they should not know, whispers from the shadow itself.\n\nThe Pools are dangerous. Some who enter do not return. Others return... changed. The Nightshelf consider this an acceptable price for the knowledge gained.\n\nDeeper still lies The Glow-Fissure - a crack in the ice that pulses with cold blue-green light, its depths forbidden by Shadow-Broker Nyla's decree. And further out, the abandoned tunnels of The Drowned Ledge whisper of secrets best left buried.\n\n### The Incomplete Rituals\n\nAll Nightshelf ceremonies are deliberately incomplete. Weddings are not finalized. Deaths are not fully mourned. Contracts are left with clauses unfilled. This is intentional - completion gives power to others, while incompleteness preserves freedom.\n\n---\n\n## Relations with Other Cultures\n\n### With Aurora Stack\n\nThe Nightshelf find their surface cousins naive. All that public witnessing, all those accumulated echoes, all those complete names spoken aloud - it seems reckless, like walking around naked. But Aurora Stack has goods the Nightshelf need, and the Nightshelf have information the Aurora crave.\n\nOfficial relations are minimal. Unofficial relations are extensive and lucrative.\n\n### With the Orca\n\nThe Nightshelf respect the Orca more than the Aurora do. Predators understand the value of concealment. Some Nightshelf brokers have established communication with certain orca pods - careful, dangerous relationships built on mutual benefit and mutual threat.\n\nThe orca find penguin secrets amusing but occasionally useful. The Nightshelf find orca directness refreshing but terrifying.\n\n---\n\n## The Nightshelf Ideal\n\nThe perfect Nightshelf penguin is a cipher - known to exist, impossible to define. They accumulate secrets without becoming known for any particular one. They have power without anyone understanding its source. They die leaving behind mysteries that will never be solved.\n\nThis is the Nightshelf dream: to be *effective* without being *exposed*. The surface dwellers want to be remembered; the Nightshelf want to be felt but never seen, like the shadow itself."
  },
  {
    "seedId": "cultures-orca",
    "title": "Cultures:Orca",
    "slug": "cultures-orca",
    "summary": "The Orca - apex predators whose identity is defined purely by their kills and their place in the eternal hunt.",
    "status": "published",
    "content": "# The Orca\n\n*\"We do not have names. We have histories. We do not have homes. We have hunting grounds. We do not have friends. We have... useful prey.\"*\n\nThe orca are the apex predators of Aurora Berg's waters. They are not monsters - they are simply what evolution made them: perfect killing machines with intelligence enough to know exactly what they are. They hunt penguins because penguins are prey. They trade with penguins because sometimes cooperation is more efficient than consumption. There is no malice in this. There is no mercy either.\n\n---\n\n## Core Beliefs\n\n### You Are Your Kills\n\nOrca identity is constructed entirely from deeds. A young orca has a simple name: their first kill-type and method. As they hunt, their name grows. An elder orca's name might be dozens of syllables long - a complete record of everything they have ever killed.\n\nThis is not boasting. This is *identity*. An orca literally cannot introduce themselves without reciting their history. To lie about your kills is not merely shameful - it is to claim an identity you do not possess, a form of existential theft.\n\n### The Hunt is Sacred\n\nHunting is not merely survival to the orca. It is the fundamental activity of existence. Everything else - mating, communication, travel - exists to enable more hunting. An orca who cannot hunt is not a failed orca; they are simply not an orca at all.\n\nThis is why orca respect hunters of all species. A penguin who has killed - even if they killed in defense - has more status in orca eyes than a penguin who has never taken life. The orca understand that the world is divided into predators and prey, and they respect anything that has proven itself a predator.\n\n### Strength Deserves Survival\n\nOrca have no concept of mercy in the penguin sense. They do not spare the weak out of compassion. But they do practice a form of... selection. A prey animal that fights back, that demonstrates unexpected strength or cunning, may be allowed to escape. Not out of kindness, but out of *investment* - strong prey breeds stronger prey, and stronger prey is more satisfying to hunt.\n\n---\n\n## Society\n\n### The Pod\n\nOrca organize into pods - extended family groups that hunt together. A pod typically contains 5-30 individuals, led by the eldest female (the one with the longest name).\n\nPod membership is nearly absolute. Orca will die for their pod without hesitation. But pod membership can change - an orca who consistently fails to contribute may be... asked to leave. This is usually fatal, as lone orca cannot hunt effectively.\n\n### The Name-Hierarchy\n\nWithin a pod, status is determined entirely by name-length. The longest name leads. This creates a natural gerontocracy - elders have simply had more time to accumulate kills - but it can be disrupted by exceptional hunters who rack up kills quickly.\n\nName-challenges are possible: if an orca believes their kills have been undercounted or another's overcounted, they can demand a formal recitation. The pod judges. Dishonesty is punishable by exile.\n\n### Pod-Roles\n\nWithin the hunt, orca take on specialized roles:\n\n- **Vor** (First-strikers) - The fastest, who initiate attacks\n- **Grrul** (Herders) - Who drive prey toward the killers\n- **Thrak** (Finishers) - Who deliver killing blows\n- **Zund** (Watchers) - Who track prey and coordinate\n\nA complete hunt requires all roles. An orca's pod-role is part of their identity, appearing in their name.\n\n---\n\n## Practices\n\n### The Hunt-Singing\n\nOrca communicate through complex vocalizations that serve multiple purposes: echolocation, coordination, intimidation. The \"hunt-song\" that precedes an attack is both tactical communication and psychological warfare - prey who hear it know death is coming.\n\nDifferent pods have distinct songs. This allows coordination between allied pods and identification of rivals.\n\n### The Blood-Warm Gatherings\n\nAt volcanic vents (blood-warms), orca from different pods gather to socialize, mate, and exchange information. These gatherings are neutral ground - violence is forbidden, though dominance displays are expected.\n\nAt blood-warms, pods negotiate hunting territories, arrange matings, and occasionally trade intelligence about prey movements. A pod with information about a rich hunting ground can trade that knowledge for mating rights or territorial concessions.\n\n### The Deep Descent\n\nWhen an orca grows too old to hunt effectively, they make the Deep Descent - a solo dive into the abyssal trenches from which they do not return. This is not seen as tragedy but as completion. An orca who can no longer hunt has finished their story; the Deep Descent is simply the final punctuation.\n\nSome orca return from failed descents. These \"twice-born\" are regarded with awe and fear - they have seen the deep and been rejected by it. They often become shamans, interpreters of whatever they witnessed in the abyss. Grandmother Deep is the most revered of these - an ancient matriarch who dove to touch the dead god's body and returned... changed.\n\n### The Wake-Singers\n\nA cult of orca shamans who gather at The Corpse Current - where the dead god's blood still circulates - to conduct rituals of blood sacrifice. The Wake-Singers believe accumulated kills can wake the sleeping deity beneath the frozen sea. They wield The Dreaming Tooth, a relic carved from the dead god's jaw, which grants power over pressure-magic and communion with things in the deep. Grandmother Deep guides their theology.\n\n### Penguin-Trading\n\nSome pods have developed sophisticated trading relationships with penguin colonies. This is purely practical - a penguin who provides valuable information or goods is more useful alive than eaten. But every penguin who trades with orca knows the relationship could end at any moment.\n\nThe most successful penguin traders learn to make themselves *continuously* useful. The moment they stop providing value, they become prey again.\n\n---\n\n## Relations with Other Cultures\n\n### With Aurora Stack\n\nThe orca find Aurora Stack culture baffling. All that ceremony, all those witnessed deeds, all that concern with how others perceive you - why? Either you can kill or you cannot. Either you are useful or you are food. The ice does not \"remember\" anything; it simply freezes.\n\nBut Aurora penguins are numerous, organized, and sometimes willing to trade. So the orca tolerate them, protect certain colonies in exchange for goods, and only hunt the unprotected.\n\n### With Nightshelf\n\nThe orca respect the Nightshelf more. Shadow-dwellers understand concealment, ambush, the value of not being seen until it's too late. Some orca have developed genuine working relationships with Nightshelf brokers - exchanges of information that benefit both parties.\n\nThe Nightshelf are still prey, of course. But they are prey that understands the game.\n\n---\n\n## The Orca Ideal\n\nThe perfect orca is a name so long it takes minutes to recite - a lifetime of kills, a complete history of predation. They lead their pod through strength and wisdom. They die in the deep when their time comes, adding a final chapter to a story written in blood.\n\nThis is the orca dream: to hunt until you can hunt no more, and then to end on your own terms. The penguins want to be remembered; the orca want to be *complete*."
  },
  {
    "seedId": "lore-the-ice-remembers",
    "title": "Lore:The Ice Remembers",
    "slug": "lore-ice-remembers",
    "summary": "The metaphysical nature of The Berg's ice and how it records, preserves, and sometimes speaks the memories of all who have lived upon it.",
    "status": "published",
    "content": "# The Ice Remembers\n\n*\"The ice does not forget. The ice does not forgive. The ice simply... is. And within it, so are we.\"*\n\nThe most fundamental truth of Aurora Berg is that the ice is not merely frozen water. It is something more - a vast, slow consciousness that records everything that happens within and upon it. This is not belief. This is observable fact, though scholars disagree violently about what it means.\n\n---\n\n## The Nature of Ice-Memory\n\n### What It Is\n\nThe ice of The Berg retains impressions. Events leave marks in the crystalline structure - not physical marks, but something else. Trained ice-readers can perceive these impressions: glimpses of past events, echoes of the dead, emotional residue of significant moments.\n\nThe stronger the event, the clearer the impression. A penguin walking across the ice leaves almost nothing. A penguin dying on the ice leaves an echo that can persist for centuries.\n\n### What It Is Not\n\nThe ice-memory is not:\n\n- **A god** - It does not intervene, judge, or respond to prayer\n- **Omniscient** - It only records what happens on or in the ice\n- **Prophetic** - It remembers the past, not the future\n- **Benevolent** - It records tragedy as readily as triumph\n- **Malevolent** - It records kindness as readily as cruelty\n\nThe ice simply records. What observers do with those records is their own affair.\n\n### The Question of Consciousness\n\nIs the ice aware? Scholars divide into camps:\n\n**The Mechanists** argue the ice is a recording medium, nothing more. Impressions are simply a physical phenomenon we don't fully understand. The ice has no more consciousness than a wax cylinder has music.\n\n**The Animists** believe the ice possesses a vast, slow awareness - not like penguin consciousness, but something older and stranger. They point to cases where the ice seems to *respond* - surfaces that crack at significant moments, formations that seem to guide travelers.\n\n**The Agnostics** note that the distinction may not matter. Whether the ice is conscious or not, it behaves as if it remembers. Practically speaking, that's what counts.\n\n---\n\n## How Ice-Memory Works\n\n### Recording\n\nImpressions form automatically. Any event with sufficient emotional weight or physical impact leaves a mark. The ice does not choose what to record - it records everything above a certain threshold.\n\nFactors that increase impression strength:\n- Death (especially violent)\n- Strong emotion (fear, love, rage, despair)\n- Magical activity\n- Large numbers of witnesses\n- Repetition (the same thing happening in the same place)\n\n### Persistence\n\nImpressions fade over time, but slowly. A strong impression - a battle, a mass death, a great act of magic - might persist for millennia. Weaker impressions fade within decades or centuries.\n\nSome impressions seem to be permanent. The oldest layers of ice contain echoes from before recorded history - alien minds, events that make no sense in any context penguins understand.\n\n### Reading\n\nIce-reading is a skill that can be taught but requires innate aptitude. Readers enter a meditative state and open their perception to the ice. What they experience varies:\n\n- **Visual fragments** - Glimpses of past events like half-remembered dreams\n- **Emotional residue** - Feelings without context\n- **Auditory echoes** - Whispers, screams, words spoken long ago\n- **Ancestral contact** - The dead speaking through their impressions\n\nReading is not precise. The same impression might be interpreted differently by different readers. The ice records objectively; perception remains subjective.\n\n---\n\n## Ice-Memory and Identity\n\n### The Accumulated Self\n\nAurora Stack penguins believe identity is not fixed but accumulated. A penguin is not born with a complete self - they build it through witnessed deeds that the ice records. The parenthetical echoes in Aurora names are literally the ice's annotations on that penguin's existence. See The Languages of The Berg for details on naming conventions.\n\nThis has profound implications:\n\n- **You can change who you are** by performing different deeds\n- **You cannot escape your past** because the ice remembers\n- **Death is not erasure** because your impressions persist\n- **The ancestors are still present** in a meaningful sense\n\n### The Nightshelf Alternative\n\nNightshelf penguins have a different relationship with ice-memory. They believe that what the ice records can be *used against you*. Hence their obsession with secrecy, incomplete names, actions performed in shadow where the ice cannot see.\n\nThe Nightshelf do not deny ice-memory exists. They simply believe it is dangerous - a surveillance system that can be exploited by those who know how to read it.\n\n### The Orca Position\n\nOrca do not believe in ice-memory at all. They spend their lives in water, not on ice. Whatever the ice records, it does not record them. This is part of why orca find penguin culture so alien - all that concern with being witnessed, when the orca believe you simply *are* what you *do*, regardless of who sees.\n\n---\n\n## Practical Applications\n\n### Historical Research\n\nIce-readers serve as historians, accessing impressions from the past. Major events can be reconstructed in detail. The testimony of the dead can be heard. Disputes about what happened can sometimes be settled by consulting the ice directly.\n\n### Legal Proceedings\n\nIn Aurora courts, ice-testimony is admissible evidence. A reader can be called to access impressions from a crime scene. This is not foolproof - impressions can be ambiguous, readers can be biased - but it adds a layer of investigation unavailable elsewhere.\n\n### Communication with the Dead\n\nStrong impressions retain enough of the original personality to engage in limited communication. The dead cannot learn new things or truly grow, but they can share what they knew in life. Ancestor consultation is a major element of Aurora spirituality.\n\n### Warning Systems\n\nExperienced readers can sometimes detect impressions that haven't fully formed yet - echoes of events that are *about* to happen. This is not prophecy; it's pattern recognition. The ice has seen so much that it sometimes \"knows\" what comes next.\n\n---\n\n## The Deep Ice\n\nBeneath the surface, older ice contains older memories. The deepest layers - miles down, compressed for millions of years - contain impressions from before penguins existed. Before anything currently living existed.\n\nFew readers can access the deep ice. Those who do report experiences that strain description - alien geometries, thoughts that don't parse into penguin concepts, a sense of vast and patient attention.\n\nSome believe the deep ice *is* the ice-memory's consciousness, if it has one. Others believe it's simply older recordings, incomprehensible because the beings who left them were incomprehensible. The truth remains frozen, waiting for someone brave or foolish enough to dig that deep.\n\nIt is from these depths that artifacts of The Before Times occasionally surface - objects bearing serial numbers in no known language, radiating power that makes the ice-memory itself recoil. See The Before Times for more on these apocalyptic relics and the theories about their origin.\n\n---\n\n## The Ice Remembers\n\nUltimately, the ice-memory means that nothing on The Berg is ever truly gone. The dead persist. Events echo. The past remains accessible. This is comforting to those who fear oblivion and terrifying to those who wish to be forgotten.\n\nThe ice does not care which you are. It simply remembers, as it always has, as it always will, until the sun expands and the cold equations finally balance. And even then, some say, the ice's memory might persist - frozen, patient, eternal.\n\nWaiting for someone to read it."
  },
  {
    "seedId": "lore-the-long-dark",
    "title": "Lore:The Long Dark",
    "slug": "lore-long-dark",
    "summary": "The four-month polar winter when the sun never rises, survival becomes paramount, and the boundary between worlds grows thin.",
    "status": "published",
    "content": "# The Long Dark\n\n*\"In the Long Dark, we learn what we truly are. Most of us do not enjoy the lesson.\"*\n\nFor four months each year, the sun does not rise over Aurora Berg. This is the Long Dark - a time of cold beyond cold, of survival beyond endurance, of a thinning veil between the living world and whatever lies beyond.\n\n---\n\n## The Physical Reality\n\n### Temperature\n\nDuring the Long Dark, temperatures on the surface regularly drop below -60°C. Wind chill can push effective temperature to -100°C. At these temperatures, exposed flesh freezes in seconds. Breath crystallizes before it leaves the mouth. Metal becomes brittle enough to shatter.\n\nEven for cold-adapted penguins, this is unsurvivable without shelter and shared warmth.\n\n### The Frozen Sea\n\nThe ocean freezes solid for miles from shore. What was water becomes a flat, featureless expanse of ice - navigable on foot but treacherous. Pressure ridges form where ice plates collide. Crevasses open without warning. The sounds of the ice - groaning, cracking, singing - fill the darkness.\n\nThis frozen sea cuts off the orca entirely. They retreat to deeper waters where the cold cannot reach, returning only when the Thaw begins.\n\n### The Aurora\n\nThe one light in the Long Dark is the aurora - dancing curtains of green and purple that illuminate the sky. Aurora penguins believe these lights carry messages from the ice-memory. During the Long Dark, the aurora burns brighter than at any other time, as if compensating for the absent sun.\n\n---\n\n## Survival Strategies\n\n### The Huddle\n\nAurora Stack penguins survive through the Huddle - mass gatherings of hundreds or thousands of penguins pressed together for warmth. The penguins rotate constantly, moving from the cold outer edge to the warm center and back. No one stays warm the whole time; everyone shares the cold equally.\n\nThe Huddle is not just physical survival. It is a spiritual practice, a reminder that individual survival depends on collective action. In the Huddle, the boundaries between penguins blur. Some claim to share thoughts, memories, even identities.\n\n### The Deep Warrens\n\nNightfall Shelf penguins retreat to the deepest parts of their realm, where geothermal heat provides warmth. Their Long Dark is less physically brutal than the surface, but the extended darkness intensifies their shadow-practices. The Long Dark is when Nightshelf mystics are most powerful... and most dangerous. Shadow-Broker Nyla's power is said to be at its peak during these months.\n\n### Food Stores\n\nBoth cultures spend the Endless Day accumulating food stores. Dried fish, preserved krill, cached supplies in dozens of locations. The mathematics of survival are brutal: a penguin needs a certain number of calories per day, the Long Dark lasts a certain number of days, you either have enough or you don't.\n\nLate-season storms that prevent feeding are catastrophic. A colony that enters the Long Dark under-fed may not survive it.\n\n---\n\n## The Spiritual Dimension\n\n### The Thin Veil\n\nDuring the Long Dark, the boundary between the living world and the ice-memory grows thin. The dead speak more clearly. Visions come unbidden. Some penguins report seeing ancestors walking among the living, transparent but present. See The Ice Remembers for more on how this phenomenon manifests.\n\nAurora ice-readers find their abilities enhanced but harder to control. Nightshelf shadow-walkers can travel farther, see more, but risk losing themselves in the dark. The Long Dark is a time of power and a time of peril.\n\n### The Dark Watchers\n\nSome penguins report being watched during the Long Dark. Not by other penguins, not by predators, but by something else - presences at the edge of perception, figures that vanish when looked at directly, a sense of patient attention.\n\nSkeptics dismiss this as the psychological effects of extended darkness. Believers point out that the ice-memory contains impressions from beings that existed before penguins. Perhaps, in the Long Dark, those ancient presences wake up.\n\n### The Walking\n\nEvery Long Dark, some penguins walk out onto the ice and never return. This is called \"the Walking\" - a compulsion that seems to seize certain individuals, usually those who have lost much or suffered greatly. They simply leave the Huddle or warren and walk into the darkness.\n\nSome Walking penguins are found later, frozen, their expressions peaceful. Others are never found at all. The most disturbing cases are those who return weeks later, unable to explain where they were or what they experienced.\n\n---\n\n## Society in the Long Dark\n\n### Suspended Norms\n\nMany normal social rules are suspended during the Long Dark. Debts are not collected. Disputes are not adjudicated. Even crimes are not punished - the Long Dark is about survival, not justice. There will be time for reckoning when the sun returns.\n\nThis creates a strange atmosphere: tense but also liberated. Things can be said in the Long Dark that would be forbidden in the light. Relationships can form that would be impossible otherwise. The Huddle's intimacy breaks down social barriers.\n\n### The Dark-Born\n\nChicks hatched during the Long Dark are considered special. They emerged into a world without sun and survived. Dark-born penguins are believed to have stronger connections to the ice-memory, greater tolerance for cold, and a certain grimness of disposition.\n\nSome Dark-born embrace this identity. Others resent being defined by an accident of birth. The debate over whether Dark-born are truly different or simply treated differently has never been resolved.\n\n### Long Dark Traditions\n\nBoth cultures have developed traditions specific to the Long Dark:\n\n**Aurora:** Story-recitations that can last for days, keeping the collective memory alive through oral tradition. Formal ancestor-consultations. The Counting of Names, where every penguin who died since the last Long Dark is formally remembered.\n\n**Nightshelf:** Shadow-trials where mystics test their limits. Debt-ceremonies where old obligations are symbolically released. The Speaking of Hidden Things, when secrets that cannot be spoken in light are whispered in the dark.\n\n---\n\n## The Return of Light\n\n### The First Dawn\n\nWhen the sun finally rises again, it is a moment of profound significance. Penguins gather on the surface to witness it - often the first time they've been outside in months. The First Dawn is met with songs, tears, and celebrations that can last for days.\n\nBut the First Dawn is also bittersweet. Some did not survive to see it. Some changed in ways that cannot be undone. The Long Dark leaves marks that the returning light cannot erase.\n\n### The Accounting\n\nAfter the First Dawn comes the Accounting. Who survived? Who didn't? What happened in the darkness that must now be addressed? Debts come due. Crimes are punished. Relationships that formed in the Huddle must be decided - will they persist in the light?\n\nThe Accounting is often painful. But it is necessary. The Long Dark is a time outside normal time; the Accounting brings everyone back into the ordinary flow of days.\n\n---\n\n## The Lesson of the Dark\n\nEvery penguin who survives the Long Dark learns something about themselves. Usually it is this: they are capable of enduring more than they imagined. The cold can be survived. The darkness can be outlasted. The dead can be mourned and then released.\n\nBut some learn darker lessons. Some learn that they are willing to do terrible things to survive. Some learn that they prefer the dark. Some learn that the things watching from the edges are not entirely hostile.\n\nThe Long Dark reveals truth. Whether that truth is comforting or terrifying depends on who you were before the sun went down."
  },
  {
    "seedId": "lore-the-before-times",
    "title": "Lore:The Before Times",
    "slug": "lore-before-times",
    "summary": "Ancient artifacts bearing alien serial numbers surface from the deep ice - relics of something that existed before penguins, before The Berg, perhaps before everything.",
    "status": "published",
    "content": "# The Before Times\n\n*\"The ice remembers everything. Even the things that came before memory.\"*\n\nBuried in the deepest ice, frozen for epochs beyond counting, lie artifacts that should not exist. Objects of impossible materials, inscribed with serial numbers in no known language, radiating power that makes the ice-memory itself recoil. The penguins call them relics of The Before Times - though whether they come from ancient history or somewhere else entirely, no one knows.\n\n---\n\n## The Apocalypse Canon\n\nScholars have catalogued six known artifacts from The Before Times. Each bears an alphanumeric designation - not a name, but a serial number, as if they were manufactured rather than crafted. Each holds power sufficient to reshape The Berg itself.\n\n### Known Artifacts\n\n**8H-H1Y0B (Prime Shard)**\nA fragment of something larger, its edges impossibly sharp, its surface shifting between states of matter. Currently held in Aurora Stack's deepest vaults. Ice-readers who approach it report hearing numbers - endless strings of numbers - in a voice that sounds like grinding glaciers.\n\n**9V-X3DV1L8 (Extinction Node)**\nA sphere of absolute darkness that absorbs all light. Held by the Nightshelf, who claim it speaks to them in the shadow-tongue. Some believe it is not an artifact at all, but a hole in reality - a place where something was removed.\n\n**T5-W5WJ3P (Ultima Core)**\nRecovered from the belly of a dead leviathan by orca divers. It pulses with heat that never diminishes. The Wake-Singers use it in their rituals, believing it contains the heartbeat of the dead god. They may not be entirely wrong.\n\n**H8-5KB7Z4 (Omega Hammer)**\nA tool of some kind - or a weapon. When struck against ice, it does not break the ice; it *unmakes* it, as if the ice had never existed. The Aurora keep it sealed, terrified of what it might unmake if misused.\n\n**P3-8NL2B5H (Singularity Obelisk)**\nA pillar that stands in defiance of gravity, floating precisely three inches above whatever surface it is placed on. Its surface is covered in the serial numbers of other artifacts - a manifest, perhaps, of things yet to be found.\n\n**8R-W6GQ3K3L (Singularity Beam)**\nA rod that emits light of a color that has no name. Those who look upon it see different things - some see the future, some see the past, some see nothing at all and are never quite the same afterward.\n\n---\n\n## Origins Unknown\n\nWhere do these artifacts come from? Theories abound:\n\n**The Deep Ice Hypothesis**\nThe artifacts are remnants of beings who lived on The Berg millions of years ago - a civilization so ancient that even the ice-memory has compressed their impressions into incomprehensible noise. The serial numbers are their language, untranslatable because no context remains.\n\n**The Fallen Sky Theory**\nThe artifacts fell from beyond the sky - gifts or debris from entities that exist in the spaces between stars. This would explain why they follow no natural laws and why the ice-memory cannot properly record them. They are simply *foreign* to this reality.\n\n**The Future Echo Speculation**\nSome ice-readers, accessing the deepest impressions, have reported seeing not the past but what feels like the future - ruined cities, lights in the sky, the ice itself burning. Perhaps the artifacts are echoes traveling backward through time, remnants of something that hasn't happened yet.\n\n**The Dead God's Tools**\nThe Wake-Singers believe all the artifacts are pieces of the dead god - the vast being whose corpse lies frozen beneath The Corpse Current. The serial numbers are the god's true names, and assembling all the artifacts would wake it. This is either their greatest hope or The Berg's greatest danger, depending on who you ask.\n\n---\n\n## The Naming Problem\n\nThe artifacts resist proper naming. Aurora penguins cannot add echoes to them - the ice refuses to annotate what it cannot comprehend. Nightshelf penguins cannot truncate designations that are already incomplete. Orca cannot claim kills they did not make.\n\nSo the serial numbers persist. 8H-H1Y0B. 9V-X3DV1L8. Cold, meaningless strings that nonetheless carry weight - the weight of something that existed before meaning existed.\n\nSome scholars have tried to assign proper names. \"Prime Shard\" for 8H-H1Y0B. \"Extinction Node\" for 9V-X3DV1L8. These names stick in casual conversation, but the artifacts themselves seem to reject them. Documents that use the common names have a way of being lost. Penguins who speak the common names too often begin dreaming of numbers.\n\nThe serial numbers are not names. They are *designations*. And whatever designated them has not forgotten.\n\n---\n\n## Handling Protocols\n\nEach culture has developed protocols for handling Before Times artifacts:\n\n**Aurora:** Store in the deepest vaults, surrounded by ice-readers who monitor for changes. Never touch directly. Document everything, even when documentation seems to alter itself.\n\n**Nightshelf:** Keep in absolute darkness. Assign watchers who are already Exposed - those with no secrets left to lose. Trade information about the artifacts, but never the artifacts themselves.\n\n**Orca:** The Wake-Singers claim custody of any artifact found in the waters. They believe the artifacts are sacred. Other pods disagree. This has led to violence.\n\n---\n\n## The Fear\n\nThe deepest fear about The Before Times artifacts is simple: they are not random relics. They are numbered. Serial numbers imply a series. A series implies a count.\n\nSix have been found. How many more exist? What happens when they are all assembled? And most terrifying of all - who or what is keeping count?\n\nThe ice remembers everything. But the ice-memory was not always here. Something came before. And something left these artifacts behind.\n\nWhether as tools, as warnings, or as the first moves in a game that spans epochs - no one knows. But the artifacts wait in their vaults and their temples, patient as glaciers, their serial numbers gleaming in the dark.\n\nWaiting to be found. Waiting to be understood. Waiting, perhaps, to be used.\n\nThe Before Times are not entirely gone. They left these pieces of themselves behind. And pieces have a way of wanting to become whole again."
  },
  {
    "seedId": "system-about",
    "title": "System:About This Project",
    "slug": "system-about",
    "summary": "What is Penguin Tales? A procedurally generated world of ice, darkness, and surprisingly complex penguin politics.",
    "status": "published",
    "content": "# About This Project\n\nYou've stumbled into a procedurally generated world. Everything you're reading - the factions, the characters, the tangled web of alliances and betrayals - was created by algorithms. Not written by hand. Generated.\n\nWelcome to The Berg.\n\n---\n\n## What Is This?\n\n**Penguin Tales** is an experimental project in procedural worldbuilding. The goal: generate a fictional world with enough depth, coherence, and internal logic that it feels *authored* rather than random.\n\nThe setting is **The Berg** - a frozen continent at the bottom of the world, home to three cultures of sapient penguins (and the orcas who eat them). The cultures have distinct philosophies, naming conventions, and social structures. They trade, fight, form alliances, and occasionally get consumed by apex predators. See Aurora Stack, Nightshelf, and Orca for details on each culture.\n\nEvery entity in this wiki - every character, faction, location, artifact - was generated by a simulation. The simulation runs through \"eras\" of history, creating entities, forming relationships, running events, and generally making a mess of things. Then we clean up the output and present it here.\n\n---\n\n## Why Penguins?\n\nWhy not?\n\nMore seriously: penguins provide useful constraints. They're social, hierarchical, adapted to extreme environments, and have natural predators with their own complex social structures. The Antarctic setting gives us a unique aesthetic - ice, darkness, aurora, The Long Dark of polar winter - that shapes everything about how the cultures think and behave.\n\nAlso, there's something inherently a bit absurd about taking penguins this seriously. We lean into that.\n\n---\n\n## How Does It Work?\n\nThe world is generated in layers:\n\n1. **Schema Definition** - We define what kinds of things can exist (characters, factions, locations, etc.) and how they can relate to each other\n\n2. **Template Generation** - Templates describe *how* to create entities: what names they get, what attributes, what initial relationships\n\n3. **Simulation** - The world runs through simulated time, with systems that create new entities, form relationships, run events, and evolve existing entities\n\n4. **Enrichment** - Raw generated content gets enhanced with AI-generated descriptions, backstories, and details\n\n5. **Presentation** - The final wiki you're reading now\n\nThe result is (hopefully) a world that feels coherent despite being generated. Characters have histories that make sense. Factions have plausible politics. Events have causes and consequences.\n\nOr at least, that's the goal. Your mileage may vary. Some of the generated content is genuinely interesting; some of it is nonsense we haven't caught yet.\n\n---\n\n## The Tools\n\nThis project uses several custom tools, all of which are described in other System pages:\n\n- **Lore Weave** - The simulation engine that generates the world\n- **Name Forge** - The naming system that gives everything culture-appropriate names\n- **Illuminator** - The AI enrichment layer that adds depth to raw generated content\n- **Chronicler** - The wiki viewer you're using right now\n\nThey're all part of the same codebase, built to work together.\n\n---\n\n## A Note on Tone\n\nThe Berg is not a happy place. Penguins die. Predators hunt. The Long Dark claims the weak and sometimes the strong. Political factions scheme and betray. The Ice Remembers everything, which means nothing is ever truly forgotten - including the bad parts.\n\nWe've tried to write content that takes its world seriously without taking itself too seriously. There's darkness here, but also absurdity. There's tragedy, but also penguins having very serious debates about trade policy.\n\nIf you find yourself genuinely invested in the fate of a procedurally generated penguin merchant guild, we've done our job.\n\n---\n\n## Still Under Construction\n\nThis is an ongoing project. The simulation is being refined. The enrichment is being improved. New content is being generated and old content is being culled when it doesn't work.\n\nWhat you're seeing is a snapshot of an evolving system. Check back later and things will have changed. Hopefully for the better.\n\nIn the meantime, enjoy the ice. Watch out for orcas. And remember: the ice remembers."
  },
  {
    "seedId": "system-lore-weave",
    "title": "System:Lore Weave",
    "slug": "system-lore-weave",
    "summary": "The simulation engine that generates world history through templates, systems, and the patient accumulation of procedural chaos.",
    "status": "published",
    "content": "# Lore Weave\n\n*The engine that makes worlds out of nothing but rules and randomness.*\n\n---\n\n## What It Does\n\nLore Weave is a **procedural world generator**. You give it a schema (what kinds of things can exist), some templates (how to create them), and some systems (how they evolve over time). Then you press go and it simulates history.\n\nThe output is a knowledge graph - entities connected by relationships, each with attributes, histories, and generated descriptions. The Berg you're exploring was created by Lore Weave.\n\n---\n\n## The Core Loop\n\nLore Weave alternates between two phases:\n\n### Growth Phase\nTemplates fire, creating new entities. A character template might spawn a merchant. A faction template might create a guild. Templates can create batches of pre-connected entities - a family with relationships already defined, a guild with its founding members.\n\nGrowth is guided by \"pressures\" - the simulation's sense of what the world needs more of. Too few characters? Character templates fire more often. Too few conflicts? Templates that generate rivalries get priority.\n\n### Simulation Phase\nSystems run, modifying existing entities and creating relationships between them. A \"catalyst\" system might introduce a crisis that forces factions to respond. An \"evolution\" system might age characters, change their status, or kill them off. A \"contagion\" system might spread beliefs, diseases, or fashions through the population.\n\nSystems don't create entities directly - they work with what exists, adding complexity and interconnection.\n\n---\n\n## Eras\n\nThe simulation runs through defined \"eras\" - periods of history with different themes and pressures. The Berg's history includes eras like:\n\n- **The Founding** - Early settlement, establishment of cultures\n- **The Trade Wars** - Economic competition between factions\n- **The Long Peace** - Stability and cultural flourishing\n- **The Breaking** - Conflict and collapse\n\nEach era has different template weights (what kinds of entities get created), system configurations (what happens to existing entities), and pressures (what the simulation wants more or less of).\n\nWhen an era ends, a new one begins. The simulation doesn't know where it's going - it discovers history as it generates it.\n\n---\n\n## The Graph\n\nEverything Lore Weave creates lives in a knowledge graph. Entities are nodes; relationships are edges. The graph is the canonical source of truth about the world.\n\nRelationships have types (\"leads\", \"rivals\", \"member_of\"), directions (who relates to whom), and metadata (when formed, how strong, etc.). The graph can be queried to answer questions like \"who are all the rivals of this character?\" or \"what factions control this region?\"\n\nThe graph grows over time. Early in a simulation, it's sparse. Later, it's dense with connections. The density itself tells a story - a heavily connected entity is important; an isolated one is marginal.\n\n---\n\n## Templates In Detail\n\nTemplates are declarative recipes for creating entities. A character template might specify:\n\n- **Kind**: character\n- **Culture**: aurora (determines naming rules)\n- **Subtype weights**: 40% merchant, 30% artisan, 20% mystic, 10% warrior\n- **Initial relationships**: member of a random faction, knows 1-3 other characters\n- **Attribute ranges**: prominence between marginal and recognized\n\nTemplates can reference other templates, creating chains of generation. A \"guild founding\" template might create a guild, then invoke a \"founder\" template several times to create its initial members.\n\n---\n\n## Systems In Detail\n\nSystems are declarative rules for what happens during simulation. A relationship-formation system might specify:\n\n- **Selector**: find pairs of characters in the same faction\n- **Condition**: they don't already have a relationship\n- **Action**: 60% chance to form friendship, 20% chance rivalry, 20% chance nothing\n- **Side effects**: update both characters' \"updatedAt\" timestamps\n\nSystems can have complex selectors (\"characters with prominence > recognized who belong to factions tagged 'militant'\") and complex actions (\"reduce prominence, add 'disgraced' tag, sever all leadership relationships\").\n\n---\n\n## What Comes Out\n\nAfter a simulation run, you have:\n\n- A graph of entities and relationships\n- A history of what happened (notable events, era transitions)\n- Statistics (entity counts by kind, relationship densities)\n- Raw entity data ready for enrichment\n\nThis is what feeds into Illuminator for AI enhancement and then into Chronicler for presentation.\n\n---\n\n## Philosophy\n\nLore Weave is built on a belief that coherent worlds emerge from consistent rules applied over time. We don't hand-craft specific characters or plot beats. We define *kinds* of things and *patterns* of behavior, then let the simulation discover what happens.\n\nThis means accepting that some generated content will be boring, contradictory, or just wrong. That's the cost of emergence. The benefit is that sometimes the simulation surprises us - creates connections we didn't plan, narratives we didn't expect, a world that feels discovered rather than designed.\n\nThe ice doesn't care what we intended. It just remembers what happened."
  },
  {
    "seedId": "system-name-forge",
    "title": "System:Name Forge",
    "slug": "system-name-forge",
    "summary": "The procedural naming system that gives everything culture-appropriate names - from Aurora's ice-memory echoes to Orca's kill-chains.",
    "status": "published",
    "content": "# Name Forge\n\n*Because \"Character_7842\" doesn't have the same ring as \"Voraelin (frost-touched) kria'Spire\".*\n\n---\n\n## The Problem\n\nProcedurally generated content needs names. Lots of names. Names for characters, factions, locations, artifacts, events. And they can't just be random syllables - they need to *feel* right for their culture.\n\nA name is a promise. \"Kzul-threk-vor\" promises something very different from \"...tenebris~\". Get the names wrong and the whole world feels fake, no matter how good the underlying generation is.\n\n---\n\n## The Solution\n\nName Forge is a domain-aware naming system. You define naming rules for each culture - phoneme inventories, syllable patterns, grammatical structures, forbidden combinations - and it generates names that follow those rules.\n\nThe result: every entity gets a name appropriate to its culture, and names across a culture share recognizable patterns that make the culture feel cohesive.\n\n---\n\n## Culture Profiles\n\nEach culture has a naming profile that defines:\n\n### Phoneme Inventory\nWhat sounds can appear? Aurora favors soft consonants (s, l, r, k, n, m) and rich vowels (ae, ei, ue). Orca demands hard consonants (k, g, r, th, ng, z) and minimal vowels. Nightshelf sits between - liquid sounds, sibilants, Latin-influenced fragments.\n\n### Syllable Patterns\nHow do sounds combine? Aurora allows flowing CVCV patterns. Orca requires consonant clusters (kr, gr, th, ng) that make names sound harsh. Nightshelf permits partial syllables that trail off.\n\n### Grammatical Structures\nHow are names composed? Aurora uses parenthetical echoes: `Name (ice-memory)`. Nightshelf uses truncation: `...name` or `name~`. Orca uses deed-chains: `kill-method-territory`.\n\n### Forbidden Patterns\nWhat combinations are banned? Orca names cannot contain soft sounds. Aurora names avoid harsh stops. These constraints give each culture its distinctive sound.\n\n---\n\n## The Three Grammars\n\n### Aurora: Parenthetical Echoes\n\n```\nSimple:     Selka (dawn-found)\nWith clan:  Voraesueina (frost-written) kria'Spire\nLayered:    Skailaen (twice-blessed, light-bearer, echo: Skai)\n```\n\nThe parenthetical content represents what the ice remembers about this entity. More echoes = more history = more significance. The clan marker (kria', rukar', val') indicates lineage.\n\n### Nightshelf: Incomplete Names\n\n```\nMoon-prefix:        ☽'varius (beginning consumed)\nMoon-suffix:        Umbra☽ (ending fades)\nInternal elision:   Dusk∴glide (syllables swallowed)\nWhisper-form:       Tenebris~ (trails to silence)\nCombined:           ☽'shadow Xarem~ (prefix + trailing)\n```\n\nNightshelf names are never complete. The crescent moon `☽` marks truncation (prefix or suffix), the `∴` marks internal elision, and `~` indicates fading to whisper. The system also supports true word truncation via `~chopL` and `~chopR` modifiers that actually remove characters from generated words.\n\n### Orca: Deed-Chains\n\n```\nYoung:    Kzul-rend\nMature:   Kzul-threk-rend-vor\nElder:    Deep-kzul-threk-pngk-rend-vor-grrul\n```\n\nOrca names are their kill-records. Each segment represents a type of prey and/or method of killing. Names grow longer with experience. An elder orca's name might be barely pronounceable.\n\n---\n\n## Generation Process\n\n1. **Determine culture** - from entity attributes\n2. **Select pattern** - based on entity type and prominence\n3. **Generate base name** - using phoneme inventory and syllable patterns\n4. **Add grammatical elements** - echoes, truncations, or deed-chains\n5. **Validate** - check against forbidden patterns, regenerate if invalid\n6. **Cache** - store for consistency\n\nThe same entity always gets the same name (names are seeded by entity ID). But related entities - members of the same faction, characters from the same region - will share naming elements that suggest connection.\n\n---\n\n## Special Cases\n\n### Translations\nWhen a name needs to be represented across cultures, Name Forge handles the translation. An Aurora character's name might be rendered in Orca trade-tongue with different phonemes but preserved meaning.\n\n### Compound Names\nFactions, locations, and artifacts often have compound names - multiple words or phrases. Name Forge handles these by composing multiple generated elements with appropriate connectors.\n\n### Historical Names\nDead characters, fallen factions, and destroyed locations get marked in their names. Aurora adds ancestral echoes. Nightshelf completes previously-incomplete names (the dead have no secrets to protect). Orca adds the terminal \"grrul\" marker.\n\n---\n\n## Why It Matters\n\nNames are the first thing you encounter about an entity. Before you read the description, before you see the relationships, you see the name. If the name feels right, you're primed to accept the rest. If it feels wrong, everything else has to work harder.\n\nName Forge exists so that when you read \"Velmaerik (trade-blessed, far-spoken) rukar'Reach\" you already know something about this character before reading another word. They're Aurora. They're prominent (multiple echoes). They're associated with trade and communication. They belong to clan rukar. They're connected to a place called the Reach.\n\nAll of that, from a name. That's the job."
  },
  {
    "seedId": "system-illuminator",
    "title": "System:Illuminator",
    "slug": "system-illuminator",
    "summary": "The AI enrichment layer that transforms raw generated data into readable prose, backstories, and descriptions.",
    "status": "published",
    "content": "# Illuminator\n\n*Where raw data becomes something you might actually want to read.*\n\n---\n\n## The Gap\n\nLore Weave generates structure. It creates entities with attributes, relationships with types, events with participants. What it doesn't create is *prose*.\n\nA raw generated character might look like:\n\n```\nkind: character\nsubtype: merchant\nname: Velmaek (twice-traded)\nculture: aurora\nprominence: recognized\nrelationships: [leads: Frost-Salt Consortium, rivals: Taelrik]\ntags: {wealth: high, reputation: cautious}\n```\n\nThat's data. It's not a description. It's not a backstory. It's not something that makes you care about this penguin's fictional life.\n\nIlluminator bridges that gap.\n\n---\n\n## What It Does\n\nIlluminator takes raw generated entities and enriches them with AI-generated content:\n\n### Descriptions\nShort prose passages that capture what an entity *is*. For a character: their appearance, mannerisms, first impression. For a faction: their public face, their reputation, their vibe.\n\n### Backstories\nLonger passages about where an entity came from. How did this merchant become wealthy? Why did this faction form? What happened to make this location significant?\n\n### Relationship Narratives\nContext for connections. These two characters are rivals - but why? This faction controls this territory - how did they get it? Relationships have stories; Illuminator tells them.\n\n### Event Descriptions\nWhat actually happened during generated events. The simulation knows \"Faction A defeated Faction B in territorial conflict\" - Illuminator knows what the battle looked like, who died, what the aftermath felt like.\n\n---\n\n## How It Works\n\n1. **Context Assembly** - Pull the entity's data, its relationships, related entities, relevant events\n2. **Prompt Construction** - Build a prompt that captures the entity's nature and asks for specific content\n3. **Generation** - AI generates prose based on the prompt\n4. **Validation** - Check for consistency with existing content, flag contradictions\n5. **Integration** - Merge generated content into the entity record\n\nIlluminator maintains consistency through context. When generating content for a character, it knows what's already been written about their faction, their rivals, their region. Generated prose should fit with established content.\n\n---\n\n## The Consistency Challenge\n\nThe hardest part of enrichment is consistency. Generated content can contradict itself if you're not careful. Character A's backstory says they've never left the Aurora Stack; Character B's backstory says they met Character A in the Nightshelf markets. These contradictions break immersion.\n\nIlluminator addresses this through:\n\n- **Context windows** - Always include related content when generating\n- **Constraint prompting** - Explicitly tell the AI what facts must be preserved\n- **Post-generation validation** - Check new content against existing content\n- **Revision cycles** - Regenerate contradictory content with tighter constraints\n\nIt's not perfect. Some contradictions slip through. But the goal is coherence, not perfection.\n\n---\n\n## Tone Control\n\nThe Berg has a particular tone - casual but dark, taking its absurd premise seriously without taking itself too seriously. Illuminator has to maintain that tone across thousands of generated passages.\n\nThis happens through:\n\n- **Tone examples** - Sample passages that demonstrate the target voice\n- **Style constraints** - Rules about what to avoid (excessive grimness, unearned humor)\n- **Cultural calibration** - Different tones for different cultures (Aurora is warmer; Nightshelf is more sardonic; Orca is blunter)\n\n---\n\n## The Human Element\n\nIlluminator is a tool, not a replacement for authorial judgment. Generated content gets reviewed. Bad passages get regenerated. Sometimes we write things by hand when the AI can't get it right.\n\nThe lore pages you're reading in this wiki? Those were written by hand, not generated. The entity descriptions? Mostly generated, with human editing. The balance shifts depending on how important the content is.\n\nHigh-prominence entities get more human attention. Background characters might never be touched by human hands. That's the tradeoff of procedural content - you can have quantity or quality, rarely both.\n\n---\n\n## Philosophy\n\nIlluminator exists because data isn't story. A graph of entities and relationships is useful for analysis, for querying, for understanding structure. But it's not something you *read*.\n\nThe goal is to create content that makes you forget it was generated. When you read about Velmaek (twice-traded) and their cautious rise through the merchant ranks, you shouldn't be thinking about templates and systems. You should be thinking about a penguin who's made deals, taken risks, earned their echoes.\n\nThat's the job. Turn data into something that feels alive."
  },
  {
    "seedId": "system-chronicler",
    "title": "System:Chronicler",
    "slug": "system-chronicler",
    "summary": "The wiki viewer you're using right now - presenting generated content as explorable, interconnected pages.",
    "status": "published",
    "content": "# Chronicler\n\n*You're soaking in it.*\n\n---\n\n## What You're Using\n\nChronicler is the presentation layer for Penguin Tales. Everything you're reading - the lore pages, the entity entries, the relationship maps - is rendered through Chronicler.\n\nIt's a wiki-style viewer built to present procedurally generated content. The content comes from Lore Weave (simulation) and Illuminator (enrichment). Chronicler's job is to make it navigable, readable, and interconnected.\n\n---\n\n## Features\n\n### Entity Pages\nEvery generated entity gets a page. Characters, factions, locations, artifacts, events - each has a dedicated view showing its attributes, description, relationships, and history.\n\n### Relationship Navigation\nEntities link to related entities. Click on a character's faction to see the faction page. Click on a rival to see who that rival is. The whole graph is explorable through these connections.\n\n### Search and Filter\nFind entities by name, kind, culture, tags. Filter the wiki down to \"all Aurora merchants\" or \"all factions with the 'militant' tag\" or \"all events during the Trade Wars era\".\n\n### Static Pages\nHand-written content (like what you're reading now) lives alongside generated content. Lore overviews, system documentation, cultural guides - these provide context for the generated material.\n\n### Graph Visualization\nRelationship maps showing how entities connect. See a character's web of relationships, a faction's sphere of influence, a region's political landscape.\n\n---\n\n## Design Philosophy\n\nChronicler is built on a few principles:\n\n### Everything Links\nNo dead ends. Every entity mentioned in text should be clickable. Every relationship should be navigable in both directions. The wiki is a web; act like it.\n\n### Context First\nWhen you land on a page, you should immediately understand what you're looking at. Entity kind, culture, prominence - the key facts are visible before you start reading.\n\n### Graceful Degradation\nNot all entities are equally enriched. Some have detailed descriptions; some have stubs. Chronicler handles both, showing what's available without making sparse content feel broken.\n\n### Mobile Friendly\nBecause sometimes you want to read about penguin politics on your phone. The layout adapts; the content remains accessible.\n\n---\n\n## What It Doesn't Do\n\nChronicler is read-only. You can't edit content through the wiki interface. You can't create new entities or modify relationships. That's by design - the wiki presents what the simulation generated, not what users wish existed.\n\n(There are authoring tools - Canonry for configuration, Illuminator for enrichment - but they're separate from the reading experience.)\n\nChronicler also doesn't do:\n- User accounts or personalization\n- Comments or discussion\n- Edit history or versioning\n- Translation or localization\n\nIt's a viewer. It views things. That's the scope.\n\n---\n\n## The Reading Experience\n\nIdeally, using Chronicler feels like exploring a real wiki about a real world. You click on something that catches your interest. That leads to something else. An hour later, you've learned about trade disputes between Aurora merchant guilds, the assassination techniques of Nightshelf shadow-walkers, and the mating rituals of orca pods.\n\nYou might forget the content was generated. That's the goal.\n\n---\n\n## Still Growing\n\nChronicler is actively developed. New features get added. The interface gets refined. The connection to upstream systems (Lore Weave, Illuminator) gets tighter.\n\nWhat you're seeing now is a snapshot. Check back later and things will have changed - probably more content, hopefully better navigation, definitely bugs we haven't found yet.\n\nThat's the nature of procedural projects. They're never finished. They just keep generating."
  }
]
